### 추출한 M 정제 과정

m <- read.csv('movie.csv', header=T, stringsAsFactors = F)

m$spectator <- gsub(',','',m$spectator)
m$spectator <- gsub('명','',m$spectator)

m[3,] <- c('어벤져스','조스 웨던',7075607, '8.80','액션, SF, 모험','2012.04.26. 개봉','12세 관람가')
m[51,'spectator'] <- 1051710
m[59,] <- c('주먹왕 랄프','리치 무어',919202,'9.33','애니메이션, 코미디','2012.12.19. 개봉','전체 관람가')
m[72,] <- c('백설공주','타셈 싱',585698,'7.47','드라마, 판타지','2012.05.03. 개봉','전체 관람가')
m[84,'spectator'] <- 407448
m[87,'spectator'] <- 348991
m[92,] <- c('무서운 이야기','정범식, 임대웅, 홍지영',331760,'6.68','공포','2012.07.25. 개봉','청소년 관람불가')
m[98,] <- c('메로엣타 반짝반짝 리사이틀','유야마 쿠니히코',287975,'0','애니메이션','2012.12.19. 개봉','전체 관람가')
m[109,] <- c('더 테러 라이브','김병우',5584295,'8.27','스릴러, 드라마','2013.07.31. 개봉','15세 관람가')
m[117,'spectator'] <- 3280151
m[124,] <- c('퍼시픽 림','길예르모 델 토로',2539115,'7.66','액션, SF, 모험','2013.07.11. 개봉','12세 관람가')
m[163,] <- c('몬스터 호텔','젠디 타타코브스키','884,988명','8.24','애니메이션, 가족','2013.01.17. 개봉','전체 관람가')
m[168,] <- c('잭 리처','크리스토퍼 맥쿼리','784,031명','7.26','액션','2013.01.17. 개봉','15세 관람가')
m[172,'spectator'] <- '600,018명'
m[191,'spectator'] <- '306,837명'
m[193,] <- c('눈의 여왕','블라드 바르베, 막심 스베시니코프','277,260명','5.25','애니메이션, 모험','2013.02.07. 개봉','전체 관람가')
m[204,] <- c('겨울왕국','크리스 벅, 제니퍼 리','10,296,101명','9.20','애니메이션, 모험','2014.01.16. 개봉','전체 관람가')
m[208,'spectator'] <- '4,802,276명'
m[223,] <- c('메이즈 러너','웨스 볼','2,812,429명','8.38','액션, 미스터리, SF','2014.09.18. 개봉','12세 관람가')
m[241,] <- c('말레피센트','로버트 스트롬버그','1,396,899명','8.39','판타지, 모험, 드라마','2014.05.29. 개봉','12세 관람가')
m[244,] <- c('가디언즈 오브 갤럭시','제임스 건','1,344,599명','8.64','액션, 모험, SF','2014.07.31. 개봉','12세 관람가')
m[252,] <- c('애나벨','존 R. 레오네티','926,107명','7.10','공포','2014.10.02. 개봉','15세 관람가')
m[260,] <- c('고질라','가렛 에드워즈','709,734명','7.05','액션','2014.05.15. 개봉','12세 관람가')
m[281,] <- c('닌자터틀','조나단 리브스만','400,333명','8.07','모험, 액션, 코미디','2014.08.28. 개봉','12세 관람가')
m[290,'spectator'] <- '321,602명'
m[292,] <- c('미녀와 야수','크리스토프 갱스','316,334명','7.48','판타지, 멜로/로맨스','2014.06.18. 개봉','전체 관람가')
m[299,] <- c('마야','알렉스 슈타더만','265,697명','8.30','애니메이션','2014.09.04. 개봉','전체 관람가')
m[310,] <- c('쥬라기 월드','콜린 트레보로우','5,546,823명','8.26','액션, 모험, SF','2015.06.11. 개봉','12세 관람가')
m[322,] <- c('앤트맨','페이튼 리드','2,847,712명','8.71','액션, SF','2015.09.03. 개봉','12세 관람가')
m[376,] <- c('그레이의 50가지 그림자','샘 테일러 존슨','364,415명','5.49','드라마, 멜로/로맨스','2015.02.25. 개봉','청소년 관람불가')
m[386,] <- c('패딩턴','폴 킹','315,024명','8.76','코미디, 가족, 모험','2015.01.07. 개봉','전체 관람가')
m[411,] <- c('닥터 스트레인지','스콧 데릭슨','5,447,269명','8.88','액션, 모험, 판타지','2016.10.26. 개봉','12세 관람가')
m[413,] <- c('신비한 동물사전','데이빗 예이츠','4,667,391명','8.69','판타지, 모험','2016.11.16. 개봉','12세 관람가')
m[419,] <- c('데드풀','팀 밀러','3,317,184명','8.53','액션','2016.02.17. 개봉','청소년 관람불가')
m[428,] <- c('마이펫의 이중생활','크리스 리노드','2,520,700명','8.67','애니메이션, 코미디','2016.08.03. 개봉','전체 관람가')
m[464,] <- c('앵그리버드 더 무비','클레이 케이티스, 퍼갈 레일리','680,622명','8.42','애니메이션, 액션','2016.05.19. 개봉','전체 관람가')
m[474,] <- c('고스트버스터즈','폴 페이그','515,553명','8.25','액션, 코미디, SF','2016.08.25. 개봉','12세 관람가')
m[483,'spectator'] <- '410,538명'
m[484,'spectator'] <- '384,791명'
m[491,] <- c('구스범스','롭 레터맨','305,131명','8.26','액션, 모험, 코미디','2016.01.14. 개봉','12세 관람가')
m[547,] <- c('해피 데스데이','크리스토퍼 랜던','1,382,650명','8.31','미스터리, 공포','2017.11.08. 개봉','15세 관람가')
m[558,] <- c('그것','안드레스 무시에티','888,836명','7.66','공포, 드라마','2017.09.06. 개봉','15세 관람가')
m[569,] <- c('47미터','조하네스 로버츠','590,045명','7.33','공포, 스릴러','2017.07.19. 개봉','15세 관람가')
m[632,'genre'] <- '드라마'
m[632,'limit'] <- '12세 관람가'
m[632,'release'] <- '2018.09.19. 개봉'
m[668,'spectator'] <- '540,631명'
m[690,'genre'] <- '다큐멘터리'
m[690,'limit'] <- '전체 관람가'
m[690,'release'] <- '2018.11.15. 개봉'
m[745,'spectator'] <- '428,009명'
m[750,'spectator'] <- '340,411명'
m[750,'director'] <- 'BTS'
m[753,'spectator'] <- '293,412명'
m[761,'spectator'] <- '219,118명'
m[782,'spectator'] <- '105,023명'
m[795,'release'] <- '2019.07.11. 개봉'
m[795,'limit'] <- '청소년 관람불가'
m[799,'spectator'] <- '69,991명'
m$spectator <- gsub(',','',m$spectator)
m$spectator <- gsub('명','',m$spectator)
m$release <- gsub('개봉','',m$release)
m$release <- gsub('.{1}\\s{1}','',m$release)
m$release <- gsub('\\.','/',m$release)
m$release <-  as.Date(m$release) 

m$point <- as.numeric(m$point)
m$spectator <- str_trim(m$spectator)
m$movie <- gsub(' ','',m$movie)
